{
    "steps0": [
        {
            "character": "Boy",
            "inventory": {
                "close": true
            }
        },
        {
            "character": "Fox"
        },
        {
            "ref": "foxOut"
        },
        {
            "text": {
                "en_us": {
                    "gamepad": "If you see a rope or vine, you can climb it by jumping at it and press the up button.",
                    "keyboard": "If you see a rope or vine, you can climb it by jumping at it and press the up button.",
                    "touch": "For climable surfaces or objects such as trees, ropes and vines the up arrow will appear on the dpad, once you jump at it."
                },
                "de_de": "Wenn du ein Seil oder Liane siehst, drücke nach oben um daran hoch zu klettern.",
                "ja_jp": "ロープやつる草を 見つけるときには ジャンプボタンなどを おしてからすぐに 上ボタンを おすと登ることが できます。",
		        "es_es": "Si ves una soga o vid, pulsa los botones de ‘saltar’ y ‘arriba’ simultáneamente y puedes trepar."
            }
        },
        {
            "character": "Fox",
            "text": {
                "en_us": "You can use the Barrel Shield to protect you from enemies and obstacles. To get out of the Barrel Shield, simply release the button.",
                "de_de": "Falls du es noch nicht herausgefunden hast, du kannst das Fass als Schield benutzen um dich vor Feinden und Hindernissen zu schützen. Um aus dem Fass zu kommen, lass den Verteidigungsknopf los.",
                "ja_jp": "たるシールドを使うと 敵やぼう害から 守るのはゲームパッドで(B) キーボードで(SPACE) スマートフォンで たるシールドボタン などをおします。 たるシールドから 出るときにはボタンを 放します。",
		        "es_es": "Puedes pulsar el ‘escudo barril’ (Barrel Shield) para protegerte contra los enemigos u obstáculos peligrosos. Cuando quieres salirte del escudo barril, suelta el botón."
            }
        },
        {
            "character": "Fox",
            "text": {
                "en_us": {
                    "gamepad": "Also don't forget that you can throw weapons and items at enemies. With the gamepad, move the right analog stick to aim, then release to throw.",
                    "keyboard": "Also don't forget that you can throw weapons and items at enemies. With the keyboard, hold a,w,s,d to aim, then release the button(s) to throw.",
                    "touch": "Also don't forget that you can throw weapons and items at enemies. With the touchscreen, hold and drag the throw icon in the upper right corner to aim, then release to throw."
                },
                "de_de": "Vergiss auch nicht, dass du Waffen und Gegenstände an deine Feinde werfen kannst. Ziele mit dem rechten Analogstick und dann lasse diesen los um zu werfen.",
                "ja_jp": "さらにゲームパッドで 右アナログスティックで 好きな方向に向ける上 放すと武器/アイテムを 敵に投げます。",
		        "es_es": "No te olives que también puedes lanzar los artículos o las armas a tus enemigos usando el stick analógico derecho. Usando el gamepad, gira el stick para apuntar y suéltalo para lanzar."
            }
        },
        {
            "character": "Boy",
            "text": {
                "en_us": "That sounds like a lot... but will I be able to attack enemies while I'm in the barrel?",
                "de_de": "Das ist recht viel... aber kann ich auch Feinde angreifen wenn ich im Fass bin?",
                "ja_jp": "わぁ〜かなり 大変そうだよね…でも、 たるシールドに 入ったままで 敵をたおせるのか？",
		        "es_es": "Tanto que recordar…¿Pero puedo luchar contra las criaturas mientras usando el escudo barril?"
            }
        },
        {
            "character": "Fox",
            "text": {
                "en_us": "I'll let you figure that out on your own, kid!",
                "de_de": "Dies darfst du selbst herausfinden!",
                "ja_jp": "それは君に任せるぞ！",
		        "es_es": "¡Eso te lo dejo a ti para averiguar!"
            }
        }

    ],
    "foxOut": [
        {
            "controls": {
                "cursors.walkAwayFrom": true,
                "duration": 1000
            }
        },
        {
            "controls": {
                "cursors.walkTo": true,
                "duration": 80
            }
        },
        {
            "controls": {
                "cursors.down": true,
                "duration": 80
            }
        }
    ]
}